/****************************************************/
/*              Лабораторная работа ╧5              */
/*                 Условный оператор                */
/*         Пример выполнение. Вариант ╧30.          */
/****************************************************/
#include <stdio.h>
int main(void) 
{
    double x, y; /* координаты точки */
     /* ввод координат */
    printf("Введите координату x > ");
    scanf("%lf", &x);
    printf("Введите координату y > ");
    scanf("%lf", &y);
    /* вывод только что введенных значений */
    printf("x=%6.3lf;  y=%6.3lf\n", x, y);
    /* проверка условий */
    if ((x >= -1 && x <= 0 && y >= -1 && y <= 0) || (x >= 0 && x <= 1 && y >= -1 && y <= 1))
    {
        printf("Точка попадает в область\n");
    }
    else
    {
        printf("Точка не попадает в область\n");
    }

    return 0;
}